DATA INPUT AND OUTOUT
CSV
EXCEL
HTML
SQL

In [1]:
import pandas as pd

In [2]:
pwd

'c:\\Users\\Siyakhanya Mjikeliso\\OneDrive - Northern Data (Pty) Ltd\\Documents\\Power BI\\Project\\Pyhton for Data Science'

In [4]:
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [5]:
df = pd.read_csv('example')

In [6]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [7]:
df.to_csv('My_Output',index=False)

In [8]:
pd.read_csv('My_Output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [14]:
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [15]:
#Writing on df
df.to_excel('Excel_Sample.xlsx',sheet_name='NewSheet')

In [16]:
from sqlalchemy import create_engine

In [17]:
engine = create_engine('sqlite:///:memory:')

In [19]:
df.to_sql('my_table',engine)

4

In [20]:
sqldf = pd.read_sql('my_table',con=engine)

In [21]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15